Tekla.Structures.Analysis.AnalysisDecomposedLoad.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisDecomposedLoad class.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.ObjectAttachedToID
Gets or sets the identifier of the object the load is attached to.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.ObjectAttachedToType
Gets or sets the type of the object the load is attached to.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.ModelLoadID
Gets or sets the identifier of the model load.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.ModelLoadGroupID
Gets or sets the identifier of the load group.

Tekla.Structures.Analysis.AnalysisDecomposedLoad.AnalysisLoadType
Gets or sets the type of the analysis decomposed load.